perf-tests/reports/after-fix-20vu.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: perf-tests/k6/scenario.js
        output: -

     scenarios: (100.00%) 1 scenario, 20 max VUs, 2m30s max duration (incl. graceful stop):
              * default: 20 looping VUs for 2m0s (gracefulStop: 30s)


running (0m01.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m00.7s/2m0s

running (0m02.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 20 VUs  0m01.7s/2m0s

running (0m03.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 20 VUs  0m02.7s/2m0s

running (0m04.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 20 VUs  0m03.7s/2m0s

running (0m05.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 20 VUs  0m04.7s/2m0s

running (0m06.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   5% ] 20 VUs  0m05.7s/2m0s

running (0m07.0s), 20/20 VUs, 0 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m06.7s/2m0s

running (0m08.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   6% ] 20 VUs  0m07.7s/2m0s

running (0m09.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   7% ] 20 VUs  0m08.7s/2m0s

running (0m10.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   8% ] 20 VUs  0m09.7s/2m0s

running (0m11.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [   9% ] 20 VUs  0m10.7s/2m0s

running (0m12.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [  10% ] 20 VUs  0m11.7s/2m0s

running (0m13.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m12.7s/2m0s

running (0m14.0s), 20/20 VUs, 20 complete and 0 interrupted iterations
default   [  11% ] 20 VUs  0m13.7s/2m0s

running (0m15.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  12% ] 20 VUs  0m14.7s/2m0s

running (0m16.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  13% ] 20 VUs  0m15.7s/2m0s

running (0m17.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  14% ] 20 VUs  0m16.7s/2m0s

running (0m18.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  15% ] 20 VUs  0m17.7s/2m0s

running (0m19.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m18.7s/2m0s

running (0m20.0s), 20/20 VUs, 40 complete and 0 interrupted iterations
default   [  16% ] 20 VUs  0m19.7s/2m0s

running (0m21.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  17% ] 20 VUs  0m20.7s/2m0s

running (0m22.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  18% ] 20 VUs  0m21.7s/2m0s

running (0m23.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  19% ] 20 VUs  0m22.7s/2m0s

running (0m24.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  20% ] 20 VUs  0m23.7s/2m0s

running (0m25.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  0m24.7s/2m0s

running (0m26.0s), 20/20 VUs, 60 complete and 0 interrupted iterations
default   [  21% ] 20 VUs  0m25.7s/2m0s

running (0m27.0s), 20/20 VUs, 68 complete and 0 interrupted iterations
default   [  22% ] 20 VUs  0m26.7s/2m0s

running (0m28.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  23% ] 20 VUs  0m27.7s/2m0s

running (0m29.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  24% ] 20 VUs  0m28.7s/2m0s

running (0m30.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  25% ] 20 VUs  0m29.7s/2m0s

running (0m31.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  0m30.7s/2m0s

running (0m32.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  26% ] 20 VUs  0m31.7s/2m0s

running (0m33.0s), 20/20 VUs, 80 complete and 0 interrupted iterations
default   [  27% ] 20 VUs  0m32.7s/2m0s

running (0m34.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  28% ] 20 VUs  0m33.7s/2m0s

running (0m35.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  29% ] 20 VUs  0m34.7s/2m0s

running (0m36.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  30% ] 20 VUs  0m35.7s/2m0s

running (0m37.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  0m36.7s/2m0s

running (0m38.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  31% ] 20 VUs  0m37.7s/2m0s

running (0m39.0s), 20/20 VUs, 100 complete and 0 interrupted iterations
default   [  32% ] 20 VUs  0m38.7s/2m0s

running (0m40.0s), 20/20 VUs, 108 complete and 0 interrupted iterations
default   [  33% ] 20 VUs  0m39.7s/2m0s

running (0m41.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  34% ] 20 VUs  0m40.7s/2m0s

running (0m42.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  35% ] 20 VUs  0m41.7s/2m0s

running (0m43.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  0m42.7s/2m0s

running (0m44.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  36% ] 20 VUs  0m43.7s/2m0s

running (0m45.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  37% ] 20 VUs  0m44.7s/2m0s

running (0m46.0s), 20/20 VUs, 120 complete and 0 interrupted iterations
default   [  38% ] 20 VUs  0m45.7s/2m0s

running (0m47.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  39% ] 20 VUs  0m46.7s/2m0s

running (0m48.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  40% ] 20 VUs  0m47.7s/2m0s

running (0m49.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  0m48.7s/2m0s

running (0m50.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  41% ] 20 VUs  0m49.7s/2m0s

running (0m51.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  42% ] 20 VUs  0m50.7s/2m0s

running (0m52.0s), 20/20 VUs, 140 complete and 0 interrupted iterations
default   [  43% ] 20 VUs  0m51.7s/2m0s

running (0m53.0s), 20/20 VUs, 148 complete and 0 interrupted iterations
default   [  44% ] 20 VUs  0m52.7s/2m0s

running (0m54.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  45% ] 20 VUs  0m53.7s/2m0s

running (0m55.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  0m54.7s/2m0s

running (0m56.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  46% ] 20 VUs  0m55.7s/2m0s

running (0m57.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  47% ] 20 VUs  0m56.7s/2m0s

running (0m58.0s), 20/20 VUs, 160 complete and 0 interrupted iterations
default   [  48% ] 20 VUs  0m57.7s/2m0s

running (0m59.0s), 20/20 VUs, 168 complete and 0 interrupted iterations
default   [  49% ] 20 VUs  0m58.7s/2m0s

running (1m00.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  50% ] 20 VUs  0m59.7s/2m0s

running (1m01.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  1m00.7s/2m0s

running (1m02.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  51% ] 20 VUs  1m01.7s/2m0s

running (1m03.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  52% ] 20 VUs  1m02.7s/2m0s

running (1m04.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  53% ] 20 VUs  1m03.7s/2m0s

running (1m05.0s), 20/20 VUs, 180 complete and 0 interrupted iterations
default   [  54% ] 20 VUs  1m04.7s/2m0s

running (1m06.0s), 20/20 VUs, 190 complete and 0 interrupted iterations
default   [  55% ] 20 VUs  1m05.7s/2m0s

running (1m07.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  1m06.7s/2m0s

running (1m08.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  56% ] 20 VUs  1m07.7s/2m0s

running (1m09.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  57% ] 20 VUs  1m08.7s/2m0s

running (1m10.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  58% ] 20 VUs  1m09.7s/2m0s

running (1m11.0s), 20/20 VUs, 200 complete and 0 interrupted iterations
default   [  59% ] 20 VUs  1m10.7s/2m0s

running (1m12.0s), 20/20 VUs, 208 complete and 0 interrupted iterations
default   [  60% ] 20 VUs  1m11.7s/2m0s

running (1m13.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  1m12.7s/2m0s

running (1m14.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  61% ] 20 VUs  1m13.7s/2m0s

running (1m15.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  62% ] 20 VUs  1m14.7s/2m0s

running (1m16.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  63% ] 20 VUs  1m15.7s/2m0s

running (1m17.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  64% ] 20 VUs  1m16.7s/2m0s

running (1m18.0s), 20/20 VUs, 220 complete and 0 interrupted iterations
default   [  65% ] 20 VUs  1m17.7s/2m0s

running (1m19.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  1m18.7s/2m0s

running (1m20.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  66% ] 20 VUs  1m19.7s/2m0s

running (1m21.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  67% ] 20 VUs  1m20.7s/2m0s

running (1m22.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  68% ] 20 VUs  1m21.7s/2m0s

running (1m23.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  69% ] 20 VUs  1m22.7s/2m0s

running (1m24.0s), 20/20 VUs, 240 complete and 0 interrupted iterations
default   [  70% ] 20 VUs  1m23.7s/2m0s

running (1m25.0s), 20/20 VUs, 250 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  1m24.7s/2m0s

running (1m26.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  71% ] 20 VUs  1m25.7s/2m0s

running (1m27.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  72% ] 20 VUs  1m26.7s/2m0s

running (1m28.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  73% ] 20 VUs  1m27.7s/2m0s

running (1m29.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  74% ] 20 VUs  1m28.7s/2m0s

running (1m30.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  75% ] 20 VUs  1m29.7s/2m0s

running (1m31.0s), 20/20 VUs, 260 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  1m30.7s/2m0s

running (1m32.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  76% ] 20 VUs  1m31.7s/2m0s

running (1m33.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  77% ] 20 VUs  1m32.7s/2m0s

running (1m34.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  78% ] 20 VUs  1m33.7s/2m0s

running (1m35.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  79% ] 20 VUs  1m34.7s/2m0s

running (1m36.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  80% ] 20 VUs  1m35.7s/2m0s

running (1m37.0s), 20/20 VUs, 280 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  1m36.7s/2m0s

running (1m38.0s), 20/20 VUs, 292 complete and 0 interrupted iterations
default   [  81% ] 20 VUs  1m37.7s/2m0s

running (1m39.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  82% ] 20 VUs  1m38.7s/2m0s

running (1m40.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  83% ] 20 VUs  1m39.7s/2m0s

running (1m41.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  84% ] 20 VUs  1m40.7s/2m0s

running (1m42.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  85% ] 20 VUs  1m41.7s/2m0s

running (1m43.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  1m42.7s/2m0s

running (1m44.0s), 20/20 VUs, 300 complete and 0 interrupted iterations
default   [  86% ] 20 VUs  1m43.7s/2m0s

running (1m45.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  87% ] 20 VUs  1m44.7s/2m0s

running (1m46.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  88% ] 20 VUs  1m45.7s/2m0s

running (1m47.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  89% ] 20 VUs  1m46.7s/2m0s

running (1m48.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  90% ] 20 VUs  1m47.7s/2m0s

running (1m49.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  1m48.7s/2m0s

running (1m50.0s), 20/20 VUs, 320 complete and 0 interrupted iterations
default   [  91% ] 20 VUs  1m49.7s/2m0s

running (1m51.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  92% ] 20 VUs  1m50.7s/2m0s

running (1m52.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  93% ] 20 VUs  1m51.7s/2m0s

running (1m53.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  94% ] 20 VUs  1m52.7s/2m0s

running (1m54.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  95% ] 20 VUs  1m53.7s/2m0s

running (1m55.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  1m54.7s/2m0s

running (1m56.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  96% ] 20 VUs  1m55.7s/2m0s

running (1m57.0s), 20/20 VUs, 340 complete and 0 interrupted iterations
default   [  97% ] 20 VUs  1m56.7s/2m0s

running (1m58.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  98% ] 20 VUs  1m57.7s/2m0s

running (1m59.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [  99% ] 20 VUs  1m58.7s/2m0s

running (2m00.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default   [ 100% ] 20 VUs  1m59.7s/2m0s

running (2m01.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s

running (2m02.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s

running (2m03.0s), 20/20 VUs, 360 complete and 0 interrupted iterations
default ↓ [ 100% ] 20 VUs  2m0s


  █ THRESHOLDS 

    create_shipment_duration
    ✓ 'p(95)<1000' p(95)=62.2779

    dashboard_duration
    ✓ 'p(95)<1000' p(95)=444.0988

    http_req_duration
    ✓ 'p(95)<1000' p(95)=342.2ms
    ✓ 'p(99)<2000' p(99)=492.46ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    login_duration
    ✓ 'p(95)<1000' p(95)=937.506

    search_duration
    ✓ 'p(95)<1000' p(95)=174.6072


  █ TOTAL RESULTS 

    checks_total.......: 2301    18.560908/s
    checks_succeeded...: 100.00% 2301 out of 2301
    checks_failed......: 0.00%   0 out of 2301

    ✓ login 200
    ✓ dashboard 200
    ✓ search 200
    ✓ open shipment 200
    ✓ track 200
    ✓ create shipment 201/200
    ✓ update shipment 200

    CUSTOM
    create_shipment_duration.......: avg=38.034947  min=11.183  med=36.8485  max=71.539   p(90)=57.4496  p(95)=62.2779 
    dashboard_duration.............: avg=277.424771 min=81.086  med=248.0525 max=500.443  p(90)=416.6969 p(95)=444.0988
    login_duration.................: avg=830.537381 min=268.216 med=855.684  max=939.987  p(90)=936.03   p(95)=937.506 
    search_duration................: avg=105.398758 min=35.313  med=100.929  max=218.542  p(90)=143.8484 p(95)=174.6072

    HTTP
    http_req_duration..............: avg=83.03ms    min=2.09ms  med=22.12ms  max=939.98ms p(90)=238.94ms p(95)=342.2ms 
      { expected_response:true }...: avg=83.03ms    min=2.09ms  med=22.12ms  max=939.98ms p(90)=238.94ms p(95)=342.2ms 
    http_req_failed................: 0.00%  0 out of 2305
    http_reqs......................: 2305   18.593173/s

    EXECUTION
    iteration_duration.............: avg=6.5s       min=6.22s   med=6.45s    max=7.43s    p(90)=6.67s    p(95)=7.32s   
    iterations.....................: 380    3.065252/s
    vus............................: 20     min=20        max=20
    vus_max........................: 20     min=20        max=20

    NETWORK
    data_received..................: 10 MB  83 kB/s
    data_sent......................: 2.0 MB 16 kB/s



running (2m04.0s), 00/20 VUs, 380 complete and 0 interrupted iterations
default ✓ [ 100% ] 20 VUs  2m0s